{
  "gitSyncId": "67e571e0af95d24f5449f219_e2239863-4d87-4358-ba86-56979729a5d6",
  "id": "list-eops_ReportPrompt",
  "unpublishedCollection": {
    "name": "ReportPrompt",
    "pageId": "list-eops",
    "pluginId": "js-plugin",
    "pluginType": "JS",
    "variables": [
      {
        "name": "prompt",
        "value": "`\n\tYou are a disaster analyst tasked with writing a comprehensive damage\n    report based on an Emergency Operation Plan and a Rescue Task Report. Your focus\n    should be on the work of volunteers engaged in rescue tasks. The report should\n    provide a detailed and clear account of the natural disaster''s damage and the\n    rescue efforts undertaken.\n\n\n    First, review the Emergency Operation Plan:\n\n\n    <emergency_operation_plan>\n\n    {{EOP}}\n\n    </emergency_operation_plan>\n\n\n    Next, examine the Rescue Task Report:\n\n\n    <rescue_task_report>\n\n    {{{TASKS}}}}\n\n    </rescue_task_report>\n\n\n    To create your damage report, follow these steps:\n\n\n    1. Analyze the information provided in both documents, paying particular attention\n    to:\n\n    a. The type and scale of the natural disaster\n\n    b. The extent of damage to infrastructure, property, and human life\n\n    c. The rescue operations carried out, especially those involving volunteers\n\n    d. The challenges faced during rescue efforts\n\n    e. The outcomes of the rescue operations\n\n\n    2. Structure your report as follows:\n\n    a. Executive Summary\n\n    b. Disaster Overview\n\n    c. Extent of Damage\n\n    d. Rescue Operations\n\n    e. Volunteer Efforts\n\n    f. Challenges and Solutions\n\n    g. Outcomes and Impact\n\n    h. Recommendations for Future Operations\n\n\n    3. When writing about volunteer efforts, highlight:\n\n    a. The number of volunteers involved\n\n    b. Specific tasks undertaken by volunteers\n\n    c. Any notable achievements or acts of heroism\n\n    d. The impact of volunteer work on the overall rescue operation\n\n\n    4. Use a professional, clear, and empathetic tone throughout the report. While\n    the content may be distressing, maintain objectivity while acknowledging the human\n    impact of the disaster.\n\n\n    5. Include relevant statistics and specific examples to support your analysis,\n    drawing from both the Emergency Operation Plan and the Rescue Task Report.\n\n\n    6. Conclude your report with actionable recommendations for improving future disaster\n    response, particularly in relation to volunteer management and deployment.\n\n\n    Ensure that each section of your report is clearly labeled and that the information\n    flows logically from one section to the next.\n\n\n    Remember to focus on providing a comprehensive analysis of the disaster''s impact\n    and the rescue efforts, with special emphasis on the role and contributions of\n    volunteers.\n\n\n    Note: You answer in Vietnamese\n\t\n\t`"
      },
      {
        "name": "queryPrompt",
        "value": "``"
      }
    ]
  }
}